lib/tasks/utils.rake

  task db_seeding: :environment do
    puts "Generating contacts"
    10.times do |i|
      Contact.create!(
        name: Faker::Name.name,
        email: Faker::Internet.email,
        kind: Kind.all.sample,
        rmk: Faker::Lorem.paragraph)
    end

    Contact.all.each do |contact|
      Random.rand(1..5).times do |i|

        puts "Generating phones #{i}/? for #{contact.name}"
        Phone.create!(
          phone: Faker::PhoneNumber.phone_number,
          contact: contact)
      end

      puts "Generating address for #{contact.name}"
      Address.create!(
        street: Faker::Address.street_address,
        city: Faker::Address.city,
        state: Faker::Address.state,
        contact: contact)
---
INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Friend"], ["created_at", "2023-12-09 18:46:19.340491"], ["updated_at", "2023-12-09 18:46:19.340491"]]
INSERT INTO "contacts" ("name", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "kinds".* FROM "kinds"
SELECT "contacts".* FROM "contacts"
INSERT INTO "phones" ("phone", "contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["phone", "319-328-7661 x37311"], ["contact_id", 1], ["created_at", "2023-12-09 19:11:18.578288"], ["updated_at", "2023-12-09 19:11:18.578288"]]
INSERT INTO "addresses" ("street", "city", "state", "contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["street", "7915 Mayme Shores"], ["city", "Huelsmouth"], ["state", "West Virginia"], ["contact_id", 1], ["created_at", "2023-12-09 19:12:14.965902"], ["updated_at", "2023-12-09 19:12:14.965902"]]