app/views/contacts/_form.html.erb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <section id="error_explanation">
        <h2><%= pluralize(contact.errors.count, "error") %> <%= t 'Message.Error.Contact' %></h2>

SELECT "addresses".* FROM "addresses" WHERE "addresses"."contact_id" = $1 LIMIT $2  [["contact_id", 1], ["LIMIT", 1]]
---
        <%= address_form.label :state, class: "form-label" %>
        <%= address_form.select :state, options_for_states(@contact.address.state), {}, {:class => "form-select"} %>