app/views/contacts/show.html.erb

SELECT "phones".* FROM "phones" WHERE "phones"."contact_id" = $1  [["contact_id", 4]]
---
    <strong><%= Contact.human_attribute_name("phones") %>:</strong>
    <% @contact.phones.each do |phone| %>