app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7], ["id", 8], ["id", 9], ["id", 10]]
---
  def index
    @addresses = Address.includes("contact").all