app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.includes("kind").all
---
SELECT "contacts".* FROM "contacts"