app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["email", "test@mail.com"], ["kind_id", 1], ["rmk", "none"], ["created_at", "2023-12-10 17:36:26.702263"], ["updated_at", "2023-12-10 17:36:26.702263"]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "kind_id" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["kind_id", 1], ["updated_at", "2023-12-06 22:24:37.331046"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)

SELECT "addresses".* FROM "addresses" WHERE "addresses"."contact_id" = $1  [["contact_id", 4]]
SELECT "kinds".* FROM "kinds" WHERE "kinds"."id" = $1  [["id", 1]]
SELECT "phones".* FROM "phones" WHERE "phones"."contact_id" = $1  [["contact_id", 4]]
---
    def set_contact
      @contact = Contact
      .includes("kind")
      .includes("phones")
      .includes("address")
      .find(params[:id])