app/controllers/kinds_controller.rb

  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save
---
INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Conhecido"], ["created_at", "2023-12-03 18:12:48.028222"], ["updated_at", "2023-12-03 18:12:48.028222"]]

  def destroy
    @kind.destroy
---
DELETE FROM "kinds" WHERE "kinds"."id" = $1  [["id", 4]]

    def set_kind
      @kind = Kind.find(params[:id])
---
SELECT "kinds".* FROM "kinds" WHERE "kinds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]